{
    "stories": [
        {
            "id": 1,
            "title": "The Whispers of Starlight",
            "text": "{{NAME}} had always felt different. On her twelfth birthday, everything changed. While walking home from school through the park, a strange shimmer caught her eye. The air around her began to sparkle, and suddenly, she could hear the wind speaking. 'You are chosen,' the breeze whispered. {{NAME}} stood perfectly still, her heart racing. Her hands started to glow with a soft blue light. She discovered she could make flowers bloom instantly, calm storms with a gesture, and communicate with animals.",
            "gender": "girl",
            "difficulty": "medium",
            "ageRange": {
                "min": 7,
                "max": 13
            }
        },
        {
            "id": 2,
            "title": "The Forest of Whispers",
            "text": "Weeks after discovering her powers, {{NAME}} ventured into the ancient forest near her grandmother's cottage. The trees seemed to recognize her, their branches bending slightly to create a path. A group of woodland creatures gathered around {{NAME}} - rabbits, deer, and even a wise old fox.",
            "gender": "girl",
            "difficulty": "medium",
            "ageRange": {
                "min": 7,
                "max": 13
            }
        },
        {
            "id": 3,
            "title": "Minecraft Portal Panic",
            "text": "[NAME] never expected his ordinary afternoon to turn into an extraordinary adventure. While playing Minecraft on his computer, a strange glitch appeared. Suddenly, the screen began to swirl, and before he could move, [NAME] was sucked into the pixelated world.",
            "gender": "boy",
            "difficulty": "medium",
            "ageRange": {
                "min": 7,
                "max": 13
            }
        },
        {
            "id": 4,
            "title": "The Minecraft Quest",
            "text": "Armed with courage and Minecraft skills, [NAME] began his mission to rescue the princess. He crafted advanced armor, enchanted his tools, and gathered a team of brave villagers. The obsidian tower loomed in the distance, a dark structure that seemed impossible to breach.",
            "gender": "boy",
            "difficulty": "medium",
            "ageRange": {
                "min": 7,
                "max": 13
            }
        }
    ]
} 